---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.Width
zh: 宽度
source: html/0889be74-8b9c-b498-54c1-04d41db3f6ce.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.Width Property

**中文**: 宽度

Width of the layer.

## Syntax (C#)
```csharp
public double Width { get; set; }
```

## Remarks
Can be 0.0 if this is a membrane layer. 0.0 is the default.